//
// Created by filip on 3/13/2025.
//
/*
 * Од тастатура се читаат непознат број на позитивни цели броеви (со максимум 5 цифри) се додека не се внесе нешто различно од број.
 * За секој број треба да се најде позицијата (од десно на лево) на првото појавување на најголемата цифра во составот на
 * бројот (цифрата на единици се наоѓа на позиција 0).
 * Потоа, да се испечати статистика за позициите на најдените цифри со максимална вредност во следниот формат:
 * * [позиција]: [вкупно броеви чија максимална цифра се наоѓа на таа позиција]

 * * 0: 2
 * * 1: 3
 * * 2: 1
 * * 3: 1
 * * 4: 1

 * за броевите 97654 48654 12345 12343 1263 12443 12643 12777
*/
#include "iostream"

using namespace std;

int main(){
    int n;

    int positions[5] = {0,0,0,0,0};

    while (cin >> n){
        if(n > 99999) break;
        int posCounter = 0;
        int tmp = 0;
        for (int i = 0; n > 0; i++) {
            if(n % 10 > tmp) {
                tmp = n % 10;
                posCounter = i;
            }
            n /= 10;
        }
        positions[posCounter]++;

    }
    for (int i = 0; i < 5; i++) {
        cout << i << ": " << positions[i] << endl;
    }
}