//
// Created by filip on 3/13/2025.
//
/*
 * Од тастатура се читаат непознат број позитивни цели броеви се додека не се внесе нешто различно од број.
 * За секој број треба да се пресмета збирот на цифрата со максимална вредност од претходно внесениот број  и сумата на цифрите на тековниот број
 * (за првиот внесен број се пресметува само сумата на неговите цифри). За секој внесен број резултатот треба да се испечати во следниот формат:

 * *[број]: [сумата на цифрите на бројот + максималната цифра од претходниот број]
 * 342: 9   //3+4+2
 * 345: 16 //3+4+5+4
 * 123: 11 //1+2+3+5
 * 456: 18 //4+5+6+3
*/

#include "iostream"

using namespace std;

int main(){
    int n;

    int prevMax = 0;
    while (cin >> n){
        int sum = 0;
        int tmp = n;
        int currMax = 0;
        while (tmp > 0){
            if(tmp % 10 > currMax) currMax = tmp % 10;
            sum += tmp % 10;
            tmp /= 10;
            if(tmp == 0) {
                sum += prevMax;
                prevMax = currMax;
            }
        }
        cout << n << ": " << sum << endl;

    }
}