//
// Created by filip on 3/9/2025.
//
/*
 * Да се напише програма во C++ која  прима три цели едноцифрени броеви од стандардниот влез, каде (a,b,c > 0 && a,b,c < 10).
 * Вашата задача е да ги комбинирате овие броеви за да генерирате еден нов троцифрен број.
 * Напомена: Комбинирањето на броевите да се изврши математички.
 * Дополнително: Дополнително, потребно е во нов ред да се испeчати разликата на секој од внесените броеви и генерираниот број.
 */

#include "iostream"

using namespace std;

int main(){
    int x, y, z;

    cin >> x >> y >> z;

    if(x < 0 || y < 0 || z < 0){
        if(x > 10 || y > 10 || z > 10) return 0;
    } else{
        int n = z + (y * 10) + (x * 100);

        cout << n << endl;

        cout << n - x << " " << n - y << " "  << n - z <<endl;
    }

}