//
// Created by filip on 3/9/2025.
//
/*
 * Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.
 * Внесената низа да се трансформира на начин што елементите кои се наоѓаат на парни позиции ќе се помножат по 2,
 * а елементите кои се наоѓаат на непарни позиции ќе се зголемат за 2.
 * Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив.
 */

#include "iostream"

using namespace std;

int main(){
    int n;
    cin >> n;

    int arr[n];

    for (int i = 0; i < n; i++) {
        int tmp;
        cin >> tmp;
        arr[i] = tmp;
    }
    // index 0 = position 1...
    for (int i = 1; i <= n; i++) {
        if(i % 2 == 0){
            arr[i - 1] *= 2;
        } else {
            arr[i - 1] += 2;
        }
    }
    for (int i = 0; i < n; i++) {
        cout << arr[i] << " ";
    }
}